import React from "react";
import Footer from "../../Footer";

function Terms() {
  return (
    <>
      <div className="terms-and-condition">
        <h5> үйлчилгээний нөхцөл</h5>
        <p>
          {" "}
          <span></span>Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br></br>
          <span></span>Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
          вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны
          үндсэн дээр хэрэгжинэ. <br></br>
          <span></span> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. <br></br>
          <span></span> Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br></br>
          <span></span> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
          вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны
          үндсэн дээр хэрэгжинэ. <br></br>
          <span></span> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. <br></br>
          <span></span> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
          вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны
          үндсэн дээр хэрэгжинэ. <br></br>
          <span></span> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина.
        </p>
      </div>
      <Footer />
    </>
  );
}

export default Terms;
